package random

import (
	"math/rand"
	"time"
)

type nickname struct {
	people            map[int][]string // 人
	cityState         []string         // 城市、国家
	drink             []string         // 饮料，喝
	constellation     []string         // 星座
	universe          []string         // 宇宙
	continent         []string         // 洲
	position          []string         // 职位
	food              []string         // 食物
	road              []string         // 路
	actSomething      []string         // 做什么事情1
	actSomethingTwo   []string         // 做什么事情2
	actSomethingThree []string         // 做什么事情3
	actSomethingFour  []string         // 做什么事情4
	adjective         []string         // 形容词
	seed              int64            // 加权因子
}

func newNickname() *nickname {
	people := make(map[int][]string, 2)
	people[0] = []string{"工藤", "女王", "甄姬", "织女", "拉夫", "雪曼", "靖瑶", "王后", "萨奇", "万德", "李奥", "阿花", "坦柯", "伽罗", "精灵", "丝柏", "阿衰", "冰心", "永恩", "库里", "白龙", "星矢", "卡卡", "宁王", "冬云", "二乔", "庄库", "蝴蝶", "摩尔", "孔亮", "河神", "小霞", "阿信", "慈禧", "吉米", "佐藤", "恋次", "麦奇", "宋江", "貂蝉", "丽晶", "吕后", "露露", "丹椒", "大罗", "亚当", "一休", "鲁尼", "黛丝", "肖恩", "宙斯", "博比", "米妮", "铃木", "西施", "贝姐", "恬娜", "小虎", "林冲", "路飞", "女娲", "济科", "含桃", "宮野", "朋也", "李察", "白鹿", "姜嫄", "柯南", "杨过", "麦克", "芈月", "西西", "索隆", "列宁", "柴进", "小罗", "石兰", "花荣", "小智", "小岛", "狡兔", "七夕", "武松", "大乔", "乔依", "佩奇", "小龙", "婉儿", "多尼", "龙猫", "金吒", "越王", "关羽", "小可", "瑟鲁", "哈登", "丹尼", "丽兰", "灰原", "子衿", "勾践", "熊二", "青蛙", "女皇", "丽娜", "猎鹰", "哈维", "诗筠", "龙王", "吴用", "孟母", "画窗", "皇后", "阿笠", "亚刃", "木吒", "乔丹", "项羽", "山治", "韩信", "约翰", "贝塔", "栗米", "彼得", "蜘蛛", "熊大", "鸣人", "娇娥", "托尼", "哪吒", "周通", "高木", "万两", "美女", "韦后", "阿春", "虞姬", "姑娘", "咪丽", "大雄", "井上", "巴赫", "高飞", "满子", "方达", "哈吉", "罗宾", "布丽", "阿汤", "超人", "白哉", "佐助", "毛利", "吉田", "皮特", "云实", "白曼", "女神", "萧言", "科比", "米奇", "白川", "艾琳", "萧炎", "杰芙", "月儿", "京优", "韦伯", "喇嘛", "花花", "霍珀", "樱木", "戴宗", "鹿辰", "雪晴", "丽春", "乔巴", "索尔", "娜美", "但丁", "邓肯", "天明", "保罗", "雀鹰", "猩猩", "苏牙", "维尼", "曹操", "乔治", "米莉", "伊布", "白雪", "贝利", "林克", "美娜", "王子", "美妮", "肯尼", "阿冈", "迈克", "比尔", "黑崎", "小兰", "白露", "舒克", "巴敏", "老五", "塔玛", "欧文", "巴乔", "刘邦", "曼青", "玲莓", "冥王"}
	people[1] = []string{"莫甘娜", "阿森纳", "加特林", "小奶猫", "詹姆斯", "内马尔", "尤西奥", "本泽马", "莫里奇", "马斯克", "盖茨比", "弗朗茨", "古利特", "孙尚香", "米老鼠", "杜兰特", "哈兰德", "肖申克", "扈三娘", "姆巴佩", "伊丽莎", "加林查", "玛西亚", "兰婧雪", "顾大嫂", "苏妲己", "罗伯逊", "安琪拉", "小可爱", "赵飞燕", "花木兰", "奥利奥", "夏洛特", "丹尼斯", "老板娘", "哈吉塔", "方沐霖", "柳如烟", "艾达王", "小懒猫", "克里夫", "魔礼红", "小仙女", "萧芷玉", "沙奈朵", "巴扎黑", "罗斯福", "弗兰科", "贝斯特", "杨玉环", "斯坦利", "特朗普", "偌伊怡", "鲁智深", "孙二娘", "钟无艳", "戚夫人", "厄齐尔", "萧冷玉", "巴特尔", "魔礼海", "刘小妹", "莫小宣", "查尔斯", "慕无霜", "阮小七", "白慕雅", "齐达內", "卡德拉", "乔布斯", "米莱狄", "坎通纳", "叶清逸", "魔礼青", "爱丽丝", "琪塔娜", "林宛白", "希金斯", "小公举", "王昭君", "越贵妃", "雅典娜", "蔡文姬", "魔礼寿", "丁俊晖", "亨得利", "塞尔比"}

	cityState := []string{"金陵", "京都", "伦敦", "鄢都", "广陵", "南非", "伊朗", "唐朝", "东北", "庐州", "山城", "北方", "埃及", "左海", "茂陵", "雾都", "巴郡", "瑙鲁", "华北", "魏国", "华东", "西周", "梅岭", "蜀郡", "南海", "东晋", "北齐", "海地", "华南", "西南", "楚国", "东方", "鲁国", "东南", "宣城", "魔都", "吴国", "帝陵", "清朝", "鹅城", "闽西", "麻城", "东京", "华中", "加纳", "西欧", "文莱", "彭城", "东魏", "北海", "丰城", "后汉", "越南", "西汉", "苏中", "东汉", "斐济", "盐城", "华西", "榕城", "芬兰", "本市", "帝都", "鄀都", "本区", "商朝", "智利", "燕国", "捷克", "羊城", "江右", "南朝", "秦朝", "西北", "潞城", "东西", "南都", "南方", "兰陵", "皖中", "泸州", "陶都", "韩国", "西晋", "西夏", "苏南", "南京", "林城", "后蜀", "夏朝", "巴黎", "锡都", "加蓬", "蜀国", "古巴", "皖南", "东周", "北燕", "邯郸", "蒙古", "东郡", "西楚", "元朝", "东海", "江左", "化城", "本省", "老挝", "冰岛", "闽南", "西方", "隋朝", "凤城", "罗马", "聊城", "泉城", "北陵", "希腊"}
	drlink := []string{"汇源", "饮料", "肉汤", "酸奶", "柠檬", "豆浆", "咖啡", "蒙牛", "牛奶", "橙汁", "茉莉", "红牛", "椰汁", "龙井", "果酒", "郎酒", "芬达", "山泉", "雪碧", "光明", "红茶", "脉动", "黑茶", "钙奶", "奶茶", "姜茶", "红酒", "金典", "鱼汤", "汽水", "啤酒", "茶叶", "椰奶", "黄酒", "米酒", "冰水", "白茶", "可乐", "花茶", "拿铁", "摩卡", "白酒", "橙子", "骨汤", "果汁", "蜂蜜", "茅台", "开水", "洋酒", "伊利", "面汤", "绿茶", "蛋汤", "汾酒", "菜汤", "水酒"}
	constellation := []string{"天鸽座", "狮子座", "玉夫座", "大熊座", "天兔座", "摩羯座", "南极座", "仙王座", "凤凰座", "小犬座", "船尾座", "绘架座", "鲸鱼座", "杜鹃座", "仙女座", "圆规座", "天鹰座", "天璇座", "唧筒座", "天龙座", "仙后座", "天箭座", "猎犬座", "开阳座", "孔雀座", "大犬座", "天枢座", "乌鸦座", "御夫座", "摇光座", "天鹅座", "天琴座", "山案座", "天秤座", "小狮座", "剑鱼座", "天鹤座", "玉衡座", "飞马座", "天炉座", "水瓶座", "猎户座", "麒麟座", "网罟座", "船底座", "水蛇座", "雕具座", "北冕座", "波江座", "巨爵座", "天蝎座", "双鱼座", "小马座", "鹿豹座", "双子座", "白羊座", "船帆座", "天燕座", "后发座", "苍蝇座", "小熊座", "射手座", "蛇夫座", "巨蟹座", "罗盘座", "天权座", "天玑座", "武仙座", "天猫座", "矩尺座", "巨蛇座", "盾牌座", "狐狸座", "豺狼座", "英仙座", "长蛇座", "时钟座", "金牛座", "天坛座", "南鱼座", "牧夫座", "海豚座", "南冕座", "飞鱼座", "螟蜒座", "蝎虎座"}
	universe := []string{"土星", "火星", "水星", "木星", "金星", "巴斯星", "艾迪星", "掠日星", "果然星", "阋神星", "推特星", "戴斯星", "北斗星", "冥王星", "哈莫星", "SUN星", "南瓜星", "泰若星", "麦兹星", "天王星", "中子星", "希尔星", "未来星", "海王星", "谷神星", "海洋星", "舒克星", "哈雷星", "塔克星", "牛郎星", "拜伦号", "鸟神星", "比格星", "褐矮星", "棱石星", "天狼星", "天马星", "卡酷星", "神火星", "怀特星", "天蛇星", "幻影星", "超新星", "般若星", "贝塔星", "天魔星", "巨石星", "拓梯星", "异能星", "永恒星", "恶魔星", "云霄星", "斯诺星", "织女星", "创世星", "魔灵星", "艾伦星", "火山星", "魔神星"}
	continent := []string{"北美洲", "南美洲", "大洋洲", "南极洲", "大西洋", "北冰洋", "印度洋"}
	position := []string{"英雄", "领导", "医生", "店员", "教师", "助理", "总裁", "司机", "厂长", "厨师", "行政", "教练", "科工", "编剧", "木工", "督导", "老板", "经理", "导购", "文员", "店长", "科长", "讲师", "会计", "财务", "超人", "总机", "翻译", "组长", "场记", "医师", "主任", "技术", "销售", "安检", "行长", "客户", "专员", "助教", "产品", "水工", "接待", "商务", "柜员", "采购", "后勤", "律师", "设计", "教授", "信贷", "校长", "仓管", "秘书", "普工", "策划", "导游", "总监", "副总", "主管", "前台", "队长"}
	food := []string{"小豆", "凉面", "红椒", "蛋挞", "雪糕", "白果", "杏仁", "糖豆", "剑鱼", "柿子", "鳗鲡", "脐橙", "海螺", "紫米", "党参", "澳龙", "蛤蜊", "丑梨", "海枣", "香砂", "煎蛋", "薇菜", "苡仁", "曲奇", "红英", "腰果", "虾壳", "芦甘", "架豆", "土豆", "当归", "乌梅", "豆花", "瓠果", "吐司", "槐薯", "芋头", "积壳", "番薯", "槟榔", "桑椹", "糯米", "蝾螺", "刀鱼", "青团", "八角", "泽兰", "带鱼", "莴苣", "蕃茄", "椰子", "山芋", "莲雾", "面包", "橙皮", "韭黄", "青椒", "砂仁", "罗勒", "芹菜", "豆奶", "魔芋", "鱼面", "藕片", "栗子", "栗米", "鲈鱼", "洋葱", "松茸", "枣子", "荆芥", "鲫鱼", "柑果", "虾饺", "果蔬", "枇杷", "桃仁", "百合", "鳅鱼", "萝卜", "红米", "麻鲢", "松子", "高粱", "卤肉", "黑鱼", "青枣", "香橼", "魭鱼", "娃娃", "橄榄", "甜橙", "洋姜", "卤蛋", "鲤鱼", "肉蔻", "蜂蜜", "秋桃", "生菜", "甘草", "带子", "红鲢", "阳桃", "甘松", "乌姜", "瓠瓜", "苋菜", "鸽子", "苦瓜", "莲藕", "杨桃", "橙子", "油菜", "蛎肉", "鲜贝", "花果", "白术", "温柏", "醋栗", "荠菜", "玉竹", "鲐鱼", "花楸", "芥菜", "油梨", "沉香", "蚕豆", "白芷", "紫薯", "青鱼", "核桃", "毛蚶", "芝麻", "粗米", "洋芋", "文蛤", "木薯", "野薯", "紫苏", "锅仔", "蔓菁", "嵌糕", "汤面", "苹果", "马蹄", "大蕉", "豆渣", "果子", "面粉", "贻贝", "芸豆", "石榴", "南瓜", "饺子", "黄瓜", "小米", "板鸭", "芦根", "白芍", "树薯", "仙草", "银耳", "红枣", "红果", "烧鸭", "冷面", "烧饼", "黄薯", "孜然", "桂丁", "地黄", "玉米", "白鲢", "指橙", "菠菜", "肉丸", "虾仁", "桑葚", "鲳鱼", "海棠", "桃胶", "豆泡", "桂皮", "牡蛎", "毛豆", "木香", "山薯", "兰瓜", "汤圆", "大豆", "蛇豆", "川芎", "豆块", "荔枝", "麻糍", "龙胆", "茄子", "青扣", "墨鱼", "沙鱼", "芜菁", "黑豆", "坚果", "豆苗", "苦柚", "板粟", "肠粉", "香梨", "橘红", "麻椒", "木竹", "瓜子", "泡芙", "小葱", "虾滑", "香蕉", "柚子", "鲸鲨", "提子", "西芹", "麦芽", "紫菜", "西梅", "鸡蛋", "笋片", "黑米", "绿豆", "豆腐", "竹笋", "栀子", "煎饼", "甜椒", "脆饼", "虾丸", "馒头", "牛肉", "尖椒", "话梅", "葛根", "枸杞", "甘蔗", "桃酥", "醉虾", "龙虾", "牛蒡", "芥兰", "甲鱼", "莲心", "燕窝", "越橘", "醉蟹", "冬枣", "文旦", "菜椒", "豆豉", "盐橙", "扁豆", "扁鱼", "米粉", "石竹", "稻谷", "冬瓜", "香菇", "酸橙", "白蔻", "草莓", "麦虾", "桂圆", "川贝", "肉桂", "茴香", "芝士", "黄皮", "辛夷", "柠檬", "沙梨", "鱼丸", "番茄", "芦笋", "荜菝", "菠萝", "春卷", "包子", "蟹黄", "莴笋", "浆果", "卤鹅", "银杏", "香菜", "海参", "凉皮", "栗壳", "烤鹅", "烤鸭", "桃子", "豆皮", "芒果", "油桃", "红薯", "白薯", "青柠", "麦子", "馍馍", "草寇", "黑枣", "白芶", "红提", "豆饼", "莲菜", "茭白", "", "黑莓", "牛杂", "板栗", "烧麦", "海胆", "杨梅", "姜黄", "青果", "线椒", "蜜瓜", "桔子", "燕麦", "木耳", "蛇果", "早茶", "茯苓", "橘皮", "山楂", "蟠桃", "佛手", "花生", "麻花", "玉延", "芋泥", "蕨菜", "海米", "松饼", "青蒜", "菜豆", "火锅", "地瓜", "山渣", "大葱", "蒜苔", "雪菜", "抄手", "香瓜", "莲子", "口蘑", "虾条", "川羌", "扬桃", "饹馇", "香果", "馅饼", "辣椒", "地椒", "草果", "豇豆", "蓝莓", "玄参", "陈皮", "米糕", "灵芝", "草菇", "米线", "瘦果", "姜芽", "麻球", "苦苣", "蘑菇", "红菇", "沙果", "茼蒿", "牛奶", "胡瓜", "豌豆", "雪梨", "柑桔", "蒜苗", "卤鸭", "山竹", "丁香", "羊肉", "藿香", "凤梨", "金桔", "面点", "韭菜", "柑橘", "沙姜", "锥栗", "人参", "土薯", "鲅鱼", "调料", "荷叶", "黑柿", "藕粉", "花菜", "甜薯", "贡菜", "青豆", "青梅", "香叶", "泥鳅", "大蒜", "丹皮", "芜荽", "青菜", "薄荷", "海白", "团子", "芥蓝", "山药", "水稻", "米饭", "花椒", "葱花", "米饺", "酸豆", "甘蓝", "海鱼", "排骨", "西瓜", "李子", "丸子", "葡萄", "紫草", "云莓", "蜜柚", "黄芪", "排草", "豆浆", "鲢子", "甜柚", "花鲢", "贝壳", "烩面", "荸荠", "板筋", "木瓜", "子姜", "糌粑", "竹荪", "草鱼", "榴莲", "生姜", "香焦", "赤贝", "芭蕉", "樱桃", "刀豆", "杏子", "菜瓜", "平菇", "良姜", "旗鱼", "扇贝", "橘子", "水芹", "黄鲢", "鳗鱼", "南姜", "香芋", "年糕", "丝瓜", "梅子", "欧楂", "花卷", "莳萝", "包菜", "花朵", "白菜", "山奈", "香椿", "毛肚", "糙米", "酱鸭", "榛子", "海鳝", "羊杂", "龙眼", "米粥", "面条", "锅贴", "麻团", "炸糕", "发糕", "切糕", "火腿", "炸鸡", "汉堡", "酸奶", "烤翅", "皮蛋", "烤鸡", "烧鸡", "混沌", "粽子", "鸡排", "牛排", "猪排", "蟹排", "蟹面", "凉粉", "肉饼", "蛋糕", "猪蹄", "烤鱼", "炒饭", "炒粉", "烤肠", "饼干", "‌饺子", "‌包子", "‌拉面", "‌煎饼", "油条", "果子", "烧鹅"}
	road := []string{"天斑路", "文儒坊", "柒房街", "布后街", "维也纳", "龙西路", "中正路", "桃花坞", "星港城", "杨桥巷", "大运河", "山塘街", "走马街", "大渡河", "蒙特港", "洪泽湖", "西路桥", "创业路", "打金街", "夕水街", "光禄坊", "科苑路", "沙奎港", "彩霞街", "嘉陵江", "甘石桥", "迈阿密", "朝阳门", "西丽路 ", "牛郎街", "曙光路", "石堡城", "马台街", "广济桥", "衣锦坊", "平政街", "沙河路", "洛阳桥", "金马路", "大强街", "春熙路", "高梁桥", "金桥路", "泥城桥", "聚宝街", "沙朗巷", "梨花巷", "建北桥", "大明湖", "石康桥", "塔子巷", "天琅湖", "玄武湖", "长乐坊", "凌飞路", "南极路", "马家街", "烟霞湖", "转龙巷", "滹沱河", "常乐镇", "虎坊桥", "紫箫路", "龙溪巷", "东大路", "茶光路", "紫苑湖", "福居路", "北海街", "国境街", "武夷路", "西珠街", "仙女湖", "青龙巷", "仓园巷", "玉溪路", "案板街", "翡月湖", "道光路", "马南路", "南路桥", "石油城", "普陀路", "金沙江", "阿里山", "北门街", "青禹湖", "富春江", "魔水湖", "涠洲镇", "乌龙巷", "大东门", "晒布路", "梨花巷", "暑袜街", "老虎桥", "马市口", "元宝街", "宝珠路", "油坊巷", "总统街", "糠市街", "东大街", "乌家巷", "实业街", "南大街", "油篓街", "松子巷", "黑龙江", "三山门", "珞珈路", "洞庭湖", "布吉路", "公馆镇", "安民巷", "小南街", "河坊街", "悠雪湖", "福成镇", "黄浦江", "芳草街", "王府街", "稀土城", "牧龙路", "莲花湖", "苏公路", "金川门", "玉川巷", "洞庭路", "芦家街", "金牛路", "磷化街", "象眼街", "黎明桥", "浆洗街", "鄱阳湖", "玛丽港", "皇城角", "白洋淀", "敬德巷", "康寿巷", "民德巷", "长缨路", "白云巷", "中山路", "风雨桥", "菩提街", "兰桂坊", "金丝街", "羊市街", "庆山城", "东寺巷", "武成巷", "安仁坊", "暮雨街", "西大街", "云龙路", "凤郡街", "学道街", "小吉坡", "翻身路", "西坝路", "复兴村", "神策门", "文殊坊", "天山路", "西仓坡", "弥敦道", "武林路", "龙虎巷", "胡同李", "凤南街", "底特律", "闸口镇", "卖鱼桥", "西场镇", "将军街", "石桥铺", "双楠路", "本公司", "沙岗路", "提督街", "书院街", "郎官巷", "石头巷", "湄公河", "朝阳路", "镜泊湖", "嘉凌湖", "昆仑巷", "石湾镇", "松江府", "乌衣巷", "骡马街", "普吉岛", "北路桥", "清凉门", "柿花桥", "太和街", "盐道街", "青莲巷", "滇池路", "水井坊", "总府街", "航天桥", "旧金山", "柿花巷", "国学巷", "天逸桥", "本校区", "炭市街", "琅琊路", "马府街", "莲雾湖", "莫愁路", "土耳其", "靖国桥", "东路桥", "紫霞街", "松花江", "凌烟瑚", "梨若塘", "横浜桥", "天竺街", "琴台路", "曲樟乡", "龙腾路", "南京路", "杜甫桥", "金蟾路", "池州府", "西岳庙", "太乙路", "头道巷", "牛口市", "青海湖", "万家巷", "丁字坡", "卫家巷", "峨眉路", "牛角坡", "金穗路", "高德镇", "东寺街", "萨拉特", "廉州巷", "北仓坡", "螺蜂街", "学院坡", "冰窖巷", "白沙镇", "奎星楼", "党江镇", "望江路", "鄂凌湖", "天竺路", "南坝路", "紫气路", "学苑桥", "教化街", "东新桥", "年丰巷", "足球城", "扬子江", "紫金路", "沱沱河", "马浦街", "钱塘江", "莫愁湖", "松毛巷", "芗箬湖", "浏阳河", "五亭桥", "金银街", "拱宸桥", "武夷山", "鸡鸣桥", "景星街", "沈官坡", "龙蟠路", "卢沟桥", "狗耳巷", "牡丹城", "骡马市", "卡宾达", "如意巷", "八廓街", "白龙江", "居仁巷", "织女府", "张家巷", "涯石街", "泸定桥", "喜帖街", "长安街", "蛇盘岗", "五华坊", "花椒巷", "大直街", "莲花桥", "金沙井", "淡村路", "玉溪街", "书林街", "安宁巷", "螺峰街", "春泽巷", "马道街", "栖夜湖", "德福巷", "拱辰街", "白塔巷", "清吟街", "牧云街", "白灵街", "罗布泊", "威尼斯", "韩信桥", "花蹊巷", "望舒街", "梅园巷", "天都城", "飞雁桥", "圆通街", "四吉堆", "丹凤街", "信义坊", "饮马巷", "砵兰街", "双桂巷", "童家巷", "赵州桥", "金燕路", "砖石城", "渡船街", "白沟路", "栖凤桥", "泥马巷", "生姜巷", "霞湾巷", "尖沙咀", "崇德巷", "桃叶渡", "鹅绒巷", "青枫巷", "龙井路", "松树街", "石头城", "七湾巷", "端仁巷", "岳宫街", "浣纱路", "禄水河", "洒金街", "芬梨道", "羊市口", "长沙街", "琵笆巷", "铜锣湾", "顺天府", "灯笼街", "索罗巷", "忆昔湖", "犀牛湖", "建设巷", "褡裢巷", "浅水湾", "忘心河", "祥和里", "洒金桥", "东光街", "炒豆巷", "崇仁街", "葵花巷", "地锦街", "天龙街", "山海街", "花红巷", "七台河", "圣宮巷", "河润街", "天蓝湖", "崇善街", "茗离湖", "静怡街", "甬道街", "瓦仓庄", "熟皮坡", "芙蓉里", "顺城街", "端珙巷", "东坡路", "巴山街", "豆腐巷", "致果巷", "枣树巷", "正府街", "果树巷", "军官街", "思枉湖", "万象街", "大兴街", "龙珠街", "牛城", "蓝巷", "海河", "滦河", "淮河", "香江", "闽江", "枝江", "芷江", "綦江", "嫩江", "湘江", "乌江", "衡山", "粉巷", "羊城", "紫巷", "东湖", "敦煌", "基隆", "徽州", "西湖", "红巷"}
	actSomething := []string{
		"在打豆豆", "吃爆米花", "在吃凉面", "在吃便当", "在吃毛豆", "在吃花生", "在喝可乐", "在装灯泡", "吃哈密瓜", "在打野狼", "在测缘分", "在喝雪碧", "在聊人生", "在吃牛排", "在切牛排", "在玩蚂蚁", "在抓蚂蚁", "在看飞鸟", "在看灰狼",
		"在打灰狼", "在看斑马", "在骑斑马", "在数斑马", "在吃汉堡", "在做汉堡", "在喝绿茶", "在用大碗", "在追蝴蝶", "在摘樱桃", "在戴墨镜", "在照魔镜", "在吃煎饼", "在摊煎饼", "在做月饼", "在吃月饼", "在看月亮", "在看星星", "在数星星",
		"在吃芝麻", "在打芝麻", "在数芝麻", "在喝啤酒", "在倒啤酒", "在开啤酒", "在送玫瑰", "在躲太阳", "在遮阳光", "在捡树叶", "在扫树叶", "在摘芹菜", "在炒芹菜", "在洗芹菜", "在躲黄蜂", "在偷蜜粉", "在找蜜蜂", "在穿马甲", "的小耳朵",
		"打老虎机", "打乒乓球", "逛金字塔", "画曼陀罗", "手磨咖啡", "骑上骏马", "看音乐会", "手工艺术", "看西游记", "吃米其林", "吃冰淇淋", "玩消消乐", "在喝豆浆", "在吃油条", "的金手套", "在摘栗子", "在采山药", "在摘山渣", "在喝早茶",
		"在喝拿铁", "在抓石头", "在玩跳棋", "在放烟花", "在丢沙包", "在放鞭炮", "在踢毽子", "在放风筝", "在讲笑话", "在打弹弓", "在打盒子", "牵着蜗牛", "在撕名牌", "在弹钢琴", "在卖西瓜", "看牡丹亭", "看岳飞传", "在买苹果", "在买香蕉",
		"在洗衣服", "在爬天梯", "在爬珠峰", "在扑蝴蝶", "在捉迷藏", "在捉蜻蜓", "在掏鸟窝", "逛动物园", "一起喝醉", "穿上金靴", "说瓜不甜", "在摔泥碗", "在跳房子", "在捏泥人", "在包粽子", "在煮饺子", "在煎饺子", "在吃冰糕", "在吃饺子",
		"登上泰山", "登上黄山", "登上珠峰", "在挂冰灯", "在挂灯笼", "在挂彩灯", "在贴对联", "在贴福字", "在找信封", "在穿西装", "在洗西装", "在洗外套", "在穿外套", "在看大象", "在骑大象", "在看猫咪", "在喂猫咪", "在逗猫猫", "在喂小鸟",
		"在装路灯", "在数路灯", "在看路灯", "在看蓝天", "在看白云", "在看星月", "在追星月", "在看彩虹", "在骑摩托", "在坐摩托", "在吃板栗", "在炒板栗", "在炖板栗", "在爬高山", "在上高山", "在爬大树", "在装电灯", "在拆电灯", "在拆灯泡",
		"在扔砖头", "在算砖头", "在上楼房", "在拆楼房", "在挖水池", "在洗水池", "在吃鸡翅", "在烤鸡爪", "在烤鸡翅", "在追蜻蜓", "在抓蜻蜓", "在喝红牛", "在喝咖啡", "在洗枕头", "在坐邮轮", "在开邮轮", "在说诺言", "在买钢笔", "在卖钢笔",
		"在追刺猬", "在看天空", "在看飞机", "在坐飞机", "在放大炮", "在等冬天", "在吃洋葱", "在等春分", "在过春天", "在等夏至", "在过夏天", "在等秋天", "在等秋分", "在等冬日", "在看航展", "在穿毛衣", "在织毛衣", "在吃豌豆", "在剥豌豆",
		"在炒豌豆", "在看海豚", "在晒黑米", "在煮黑米", "在吃黑米", "在吃玉米", "在煮玉米", "在剥玉米", "在打老鼠", "在看帅哥", "在看美女", "在送鲜花", "在摘鲜花", "在插鲜花", "在买服饰", "在喝开水", "在烧开水", "在吃花卷", "在买画板",
		"在洗秀发", "在坐火车", "在修火车", "在开汽车", "在坐汽车", "在修汽车", "在做方盒", "在吃大米", "在收大米", "在晒大米", "在煮高粱", "在吃高粱", "在晒高粱", "在吃小米", "在晒小米", "在吃麦片", "在煮麦片", "在做水杯", "在做水壶",
		"在戴手套", "在织手套", "在织围巾", "在戴围巾", "在穿鞋子", "在洗鞋子", "在点鼠标", "在玩手机", "在修手机", "在玩电脑", "在修电脑", "在买书本", "在看图书", "在看漫画", "在写汉字", "在抽香烟", "在在抽烟", "在看夕阳", "在修台灯",
		"在穿皮带", "在买皮带", "在做钥匙", "在听故事", "在讲故事", "在摘花瓣", "在买滑板", "在买画笔", "在吃饼干", "在开宝马", "在修宝马", "在扔石头", "在骑河马", "在看河马", "在看犀牛", "在骑犀牛", "在躺草地", "在躲寒风", "在吃橘子",
		"在摘橘子", "在剥橘子", "在戴耳机", "在骑鸵鸟", "在追鸵鸟", "在削铅笔", "在扔硬币", "在吃热狗", "在烤热狗", "在洗毛巾", "在买毛巾", "在举哑铃", "在搬板凳", "在扫枫叶", "在摘荷花", "在养乌龟", "在买乌龟", "在做衬衫", "在蹲草丛",
		"在骑蜗牛", "在打蜗牛", "在追猎豹", "在打棒球", "在打篮球", "在打电话", "在打游戏", "在养宠物", "在养老虎", "在养鸭子", "在涮羽毛", "在涮翅膀", "在背书包", "在烤炸鸡", "在追大雁", "在看招牌", "在吃冰棍", "在戴帽子", "在吃菠萝",
		"在削菠萝", "在切菠萝", "在吃蛋挞", "在做蛋挞", "在喷香水", "在吃桃子", "在吃吐司", "在烤吐司", "在游溪流", "在打黄豆", "在煮黄豆", "在煮黑豆", "在吃樱桃", "在养鸽子", "在做花卷", "在养海豚", "在吃荔枝", "在摘荔枝", "在照镜子",
		"在吃曲奇", "在吃蘑菇", "在养松鼠", "在吃虾米", "在摘紫菜", "在吃紫菜", "在养金鱼", "在剥柚子", "在吃柚子", "在喝果汁", "在打果汁", "在戴项链", "在穿布鞋", "在挖土豆", "在吃雪糕", "在戴铃铛", "在戴手链", "在点香氛", "在喝红酒",
		"在开红酒", "在喝酸奶", "在点蜡烛", "在打糖豆", "在吃糖豆", "在吃薯片", "在洗豆芽", "在吃豆芽", "在切冬瓜", "在吃冬瓜", "在吃香菇", "在洗香菇", "在摘草莓", "在吃草莓", "在吃柠檬", "在摘柠檬", "在切柠檬", "在做纸鹤", "在吃芒果",
		"在吃面包", "在做面包", "在做面点", "在养龙猫", "在养金毛", "在折飞机", "望穿秋水", "掐指一算", "横扫千军", "一眼定情", "在打王者", "在打游戏", "看水浒传", "在养大象", "看世界杯", "求而不得", "舞力四射", "横扫六合", "心花怒放",
		"在看电影", "在刷短剧", "在钓翘嘴", "在钓鲤鱼", "在钓鲢鳙", "看演唱会", "在洗拖把", "在洗抹布", "在喝饮料", "在养蜗牛", "在抓青蛙", "在抓牛蛙", "挑灯夜读", "爱打豆豆",
	}

	actSomethingTwo := []string{"上浙大", "学英语", "游西湖", "逛铁塔", "吃西瓜", "剥橘子", "剥柚子", "过秋天", "逛超市", "喝奶茶", "看话剧", "办画展", "摆地摊", "打老虎", "逛花市", "幼稚鬼", "淘气鬼", "小淘气", "卖早餐", "喝啤酒", "讲笑话", "爬珠峰", "爬天梯", "骑骆驼", "吃油条",
		"看猴子", "看动画", "逛西湖", "游长江", "打游戏", "财运旺", "逛长城", "爬长城", "爬泰山", "爬庐山", "爬黄山", "打麻将", "打麻糍", "爬华山", "逛商场", "踢足球", "穿马甲", "打台球", "过冬日", "过冬至", "过春节", "逛灯会", "打豆豆", "打铁花", "打老鼠",
		"喝咖啡", "喝拿铁", "削苹果", "跪榴莲", "喝豆浆", "黑着脸", "捉蜜蜂", "捉蝴蝶", "打蜗牛", "骑蜗牛", "戴帽子", "放鞭炮", "放风筝", "扑蝴蝶", "捉迷藏", "摘栗子", "吹竹笛", "玩跳棋", "看三国", "戴手表", "跳皮筋", "踢毽子", "打弹弓", "牵着狗", "玩桌球",
		"上北大", "上清华", "上哈佛", "上耶鲁", "看流星", "看星星", "看日落", "看夕阳", "逛巴黎",
	}
	actSomethingThree := []string{
		"在健身", "在泡茶", "在喝水", "在养牛", "在养马", "在养猪", "在养狗", "在养鱼", "在出海", "在打鱼", "在直播", "在喝酒", "在喝汤", "在深圳", "在广州", "在江西", "在吃瓜", "在倒茶", "在开锁", "在骑车", "在躲雨", "发大财", "在煎蛋", "在放羊", "在插花", "在充电", "在钓鱼", "在养鸡",
		"在喝粥", "在烤鸡", "在拍掌", "在晨跑", "在喝茶", "在修车", "煮小米", "在听歌", "在唱歌", "在跳舞", "在打字", "在划水", "在卖鞋", "在搭车", "在吃虾", "在嚓茶", "在数羊", "在遛弯", "在打针", "牵绵羊", "放烟花", "放烟火",
		"在K歌", "在撸猫", "在奔跑", "在写信", "在背书", "在写诗", "在遛狗", "在看书", "会发财", "在冲浪", "在斗牛", "在吹牛", "在跳绳", "在打球", "在画画", "在跑步", "在放牛", "在蹦极", "在蹦迪", "在摆烂", "在漂流",
	}

	actSomethingFour := []string{
		"救了一只猫", "在巴黎徒步", "完成了训练", "完成了潜水", "大力出奇迹", "得到了金奖", "踢爆世界杯", "有亿点忧伤", "完成了滑雪", "完成了跳伞", "看非洲雄狮", "在回忆童年", "研究木乃伊", "在罗马斗牛", "参加马拉松", "品北巷栀酒", "品茉莉花茶",
		"救了一条狗", "救了牧羊犬", "穿上了盛装", "一起打雪仗", "一起堆雪人", "说骑大明湖", "去西湖玩水", "练习毛笔字", "正在写心经", "在东京赏花", "在东京看花", "在武汉赏花", "在武汉看花", "在吃糖葫芦", "养了一只猫", "养了一只狗", "骑上小摩托",
		"种了一棵树", "在玩拨浪鼓", "逛中央公园", "爬哈利法塔", "完成了翻袋", "搭乘公交车", "在挥手告别", "抓来一只猫", "抓来一只狗", "牵来一头驴", "放出了大招", "在积攒怒气", "在积攒能量", "看神笔马良", "看蚂蚁搬家", "在挑灯夜读", "在西湖看狗",
		"在西湖看花", "在西湖看海", "在西湖赏花", "赏西湖美景", "在东湖看花", "在东湖看海", "在东湖赏花", "赏东湖美景", "一杆斯诺克", "在东海抓鱼", "在东海洗脚", "在东海游泳", "在西湖游泳", "在东湖游泳", "在西湖洗脚", "在东湖洗脚", "在西湖旅游",
		"在东湖旅游", "在南海抓鱼", "在南海洗脚", "在南海游泳", "在南海钓鱼", "在东海钓鱼", "在西湖钓鱼", "在东湖钓鱼", "豪气了一把", "品信阳毛尖", "品西湖龙井", "看市井繁华", "看市井烟火", "看市井百态", "看市井长巷", "看风花雪月", "看小李飞刀",
		"种了梧桐树", "种了罗汉松", "种了桂花树", "种了菩提树", "种了白果树", "在东海看花", "在江苏暴走", "在浙江暴走", "在江西暴走", "在上海暴走", "在东京暴走", "在海南暴走", "在广西暴走", "在湖南暴走", "在湖北暴走", "在西臧徒步", "在四川徒步",
		"在重庆徒步", "在重庆爬山", "在四川爬山", "在江西爬山", "在广州暴走", "在广州徒步", "在深圳暴走", "在深圳徒步", "在浙江徒步", "在江西徒步", "在海南游泳", "在东北徒步", "在东北滑雪", "在上海徒步", "在青海徒步", "喝上了茅台", "喝上了茅子",
		"喝上了飞天", "追上了汽车", "追上了火车", "追上了马车",
	}

	adjective := []string{"卖萌的", "腹黑的", "干净的", "魔幻的", "仗义的", "简单的", "年轻的", "美丽的", "可靠的", "路过的", "迅速的", "追风的", "繁荣的", "怕黑的", "壮观的", "狂野的", "微醺的", "苹果的", "高挑的", "拉风的", "完美的", "呆萌的", "文艺的", "发怒的", "活泼的", "难过的", "时尚的", "青春的", "能干的", "忧心的", "宽容的", "糊涂的", "傲娇的", "追寻的", "爱吃的", "沉着的", "光亮的", "等待的", "香蕉的", "体贴的", "踏实的", "清秀的", "无情的", "悲伤的", "高大的", "无聊的", "聪明的", "严肃的", "甜甜的", "虚心的", "乖乖的", "神勇的", "冷冷的", "失眠的", "现实的", "负责的", "捣蛋的", "暴躁的", "矮小的", "欢喜的", "明亮的", "大意的", "深情的", "悲凉的", "自然的", "爱美的", "睿智的", "跳跃的", "炫耀的", "打盹的", "逆袭的", "诚心的", "冷静的", "嘴碎的", "茫然的", "瘦瘦的", "考研的", "逃课的", "美好的", "哭泣的", "牵强的", "阳光的", "坚强的", "孤单的", "大方的", "潇洒的", "单薄的", "丰富的", "隐身的", "复杂的", "妩媚的", "义气的", "帅气的", "美满的", "现代的", "忐忑的", "呐喊的", "炙热的", "精明的", "微笑的", "幽默的", "痛苦的", "梦幻的", "重要的", "执着的", "受伤的", "满意的", "激动的", "无限的", "开放的", "健壮的", "霸气的", "儒雅的", "沉稳的", "直率的", "深沉的", "默默的", "坚韧的", "孝顺的", "读研的", "大胆的", "单身的", "安详的", "真实的", "长情的", "发财的", "烦恼的", "务实的", "柔弱的", "尊敬的", "称心的", "清脆的", "苗条的", "淡定的", "愉快的", "碧蓝的", "土豪的", "正直的", "飘逸的", "冷傲的", "个性的", "含蓄的", "幸运的", "发呆的", "任性的", "发嗲的", "辛勤的", "求醉的", "调皮的", "过时的", "传统的", "强悍的", "胆小的", "沉静的", "近视的", "快乐的", "阳刚的", "健康的", "饱满的", "认真的", "自由的", "风趣的", "魁梧的", "威武的", "淡淡的", "玩命的", "落寞的", "活力的", "痴情的", "忧郁的", "欢乐的", "天生的", "温婉的", "友好的", "咆哮的", "感性的", "孤独的", "斯文的", "机灵的", "不安的", "高雅的", "轻松的", "整齐的", "内向的", "单纯的", "淡然的", "醉熏的", "秀丽的", "高高的", "俊秀的", "不变的", "顺利的", "好帅的", "糟糕的", "隐形的", "曾经的", "犹豫的", "无奈的", "铁打的", "舒服的", "包容的", "高兴的", "欣慰的", "优秀的", "细心的", "激情的", "喜悦的", "慕名的", "强健的", "无心的", "豪气的", "飞奔的", "悦耳的", "傻傻的", "低调的", "专一的", "果断的", "畅快的", "失恋的", "迷离的", "爱笑的", "陶醉的", "疯狂的", "谦让的", "温暖的", "标致的", "缥缈的", "成就的", "敏感的", "烂漫的", "谦逊的", "逃跑的", "刻苦的", "闪闪的", "听话的", "虚幻的", "动听的", "害羞的", "害怕的", "苦闷的", "奇葩的", "乐观的", "另类的", "豁达的", "着急的", "无敌的", "漂亮的", "率性的", "俏皮的", "欣喜的", "动人的", "凶狠的", "谨慎的", "文静的", "洁净的", "坏坏的", "喝醉的", "勤奋的", "温顺的", "丰满的", "激昂的", "冷酷的", "慷慨的", "懦弱的", "忧虑的", "超帅的", "寂寞的", "无邪的", "含糊的", "奔放的", "慈祥的", "感动的", "勤恳的", "多情的", "纯情的", "英俊的", "冲动的", "独立的", "爱哭的", "犯傻的", "敬业的", "谦和的", "结实的", "愤怒的", "憨厚的", "热心的", "故意的", "贤惠的", "伶俐的", "直爽的", "豪爽的", "积极的", "空虚的", "自信的", "懵懂的", "飞翔的", "明理的", "喧闹的", "伤情的", "很酷的", "忧伤的", "笨笨的", "失落的", "鬼畜的", "暴走的", "迷茫的", "舒适的", "平常的", "鲤鱼的", "机智的", "英勇的", "坦率的", "耍酷的", "搞怪的", "奔跑的", "放肆的", "落后的", "爱玩的", "雪白的", "火爆的", "销魂的", "自觉的", "无辜的", "无私的", "吹牛的", "羞涩的", "阔达的", "酷酷的", "冷艳的", "欢呼的", "大气的", "苦恼的", "优雅的", "大力的", "迷路的", "俊逸的", "勤劳的", "怡然的", "生动的", "娇气的", "帅呆的", "风中的", "从容的", "鳗鱼的", "优美的", "甜美的", "微胖的", "灵巧的", "紧张的", "合适的", "兴奋的", "纯真的", "安静的", "沉默的", "彩色的", "吐槽的", "花痴的", "珍贵的", "奋斗的", "寒冷的", "坚定的", "独特的", "彷徨的", "细腻的", "超级的", "野性的", "胖胖的", "私奔的", "平淡的", "成熟的", "知性的", "专注的", "可爱的", "腼腆的", "迷人的", "甜蜜的", "仁爱的", "热情的", "靓丽的", "爽快的", "昏睡的", "买醉的", "俭朴的", "清爽的", "心软的", "天真的", "和谐的", "顺心的", "如意的", "稳重的", "典雅的", "小巧的", "开朗的", "殷勤的", "撒娇的", "善良的", "健身的", "急躁的", "行走的", "开心的", "礼貌的", "贪玩的", "博学的", "粗心的", "失望的", "背后的", "不羁的", "高贵的", "无语的", "酷炫的", "焦虑的", "唠叨的", "外向的", "危机的", "刚毅的", "端庄的", "虚拟的", "幸福的", "朴素的", "健忘的", "缓慢的", "文雅的", "绅士的", "欢快的", "舒心的", "叛逆的", "拉长的", "聪慧的", "朴实的", "温柔的", "老实的", "拼搏的"}
	return &nickname{
		people:            people,
		cityState:         cityState,
		drink:             drlink,
		constellation:     constellation,
		universe:          universe,
		continent:         continent,
		position:          position,
		food:              food,
		road:              road,
		actSomething:      actSomething,      // 吃爆米花 的 马骥
		actSomethingTwo:   actSomethingTwo,   // 上浙大 的 莫扎特
		actSomethingThree: actSomethingThree, // 在直播 的 莫扎特
		actSomethingFour:  actSomethingFour,  // 马骥 救了牧羊犬
		adjective:         adjective,
	}
}

func (l *nickname) Generate() string {
	rand.Seed(l.seed)
	selected := rand.Intn(49)
	switch selected {
	// （城、国）+形容词+人物 例如 埃及帅气的梅西 7
	case 0:
		rand.Seed(l.seed + 1)
		lens := rand.Intn(2)
		name := l.cityState[rand.Intn(len(l.cityState))] + l.adjective[rand.Intn(len(l.adjective))] + l.people[lens][rand.Intn(len(l.people[lens]))]
		return name
		// （城、国）+形容词+食物 例如 埃及帅气的栗子 7
	case 1:
		name := l.cityState[rand.Intn(len(l.cityState))] + l.adjective[rand.Intn(len(l.adjective))] + l.food[rand.Intn(len(l.food))]
		return name
		// （城、国）+形容词+职务 例如 埃及帅气的经理 7
	case 2:
		name := l.cityState[rand.Intn(len(l.cityState))] + l.adjective[rand.Intn(len(l.adjective))] + l.position[rand.Intn(len(l.position))]
		return name
		// 爱喝+饮料+的+人物 例如 爱喝汇源的梅西 7
	case 3:
		name := "爱喝" + l.drink[rand.Intn(len(l.drink))] + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		// 爱喝+饮料+的+职位 例如 爱喝汇源的经理 7
	case 4:
		name := "爱喝" + l.drink[rand.Intn(len(l.drink))] + "的" + l.position[rand.Intn(len(l.position))]
		return name
		// 爱吃+食物+的+人物 例如 爱吃大米的梅西 7
	case 5:
		name := "爱吃" + l.food[rand.Intn(len(l.food))] + "的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		// 爱吃+食物+的+职位 例如 爱吃大米的经理 7
	case 6:
		name := "爱吃" + l.food[rand.Intn(len(l.food))] + "的" + l.position[rand.Intn(len(l.position))]
		return name
		// 我在+(城、国）+等+人物 例如 我在伦敦等梅西 7
	case 7:
		name := "我在" + l.cityState[rand.Intn(len(l.cityState))] + "等" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		// 我在+(城、国）+等+职位 例如 我在伦敦等经理 7
	case 8:
		name := "我在" + l.cityState[rand.Intn(len(l.cityState))] + "等" + l.position[rand.Intn(len(l.position))]
		return name
		//我在+(城、国）+喝+大米 例如 我在伦敦吃豆包 7
	case 9:
		name := "我在" + l.cityState[rand.Intn(len(l.cityState))] + "喝" + l.food[rand.Intn(len(l.food))]
		return name
		//我在+(城、国）+喝+饮料 例如 我在伦敦喝汇源 7
	case 10:
		name := "我在" + l.cityState[rand.Intn(len(l.cityState))] + "喝" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+天斑路+喝+汇源 例如 在天斑路喝汇源 7
	case 11:
		name := "在" + l.road[rand.Intn(len(l.road))] + "喝" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+北美洲+喝+汇源 例如 在北美洲喝汇源 7
	case 12:
		name := "在" + l.continent[rand.Intn(len(l.continent))] + "喝" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+狮子座+喝+汇源 例如 在狮子座喝汇源 7
	case 13:
		name := "在" + l.constellation[rand.Intn(len(l.constellation))] + "喝" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+海王星+喝+汇源 例如 在海王星喝汇源 6-7
	case 14:
		name := "在" + l.universe[rand.Intn(len(l.universe))] + "喝" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+天斑路+喝+汇源 例如 在天斑路吃大米 7
	case 15:
		name := "在" + l.road[rand.Intn(len(l.road))] + "吃" + l.food[rand.Intn(len(l.food))]
		return name
		//在+北美洲+吃+汇源 例如 在北美洲吃大米 7
	case 16:
		name := "在" + l.continent[rand.Intn(len(l.continent))] + "吃" + l.food[rand.Intn(len(l.food))]
		return name
		//在+狮子座+吃+汇源 例如 在狮子座吃大米 7
	case 17:
		name := "在" + l.constellation[rand.Intn(len(l.constellation))] + "吃" + l.food[rand.Intn(len(l.food))]
		return name
		//在+海王星+吃+栗子 例如 在海王星吃栗子 7
	case 18:
		name := "在" + l.universe[rand.Intn(len(l.universe))] + "吃" + l.food[rand.Intn(len(l.food))]
		return name
		//在+天斑路+买+饮料 例如 在天斑路买饮料 7
	case 19:
		name := "在" + l.road[rand.Intn(len(l.road))] + "买" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+南美洲+买+饮料 例如 在南美洲买饮料 7
	case 20:
		name := "在" + l.continent[rand.Intn(len(l.continent))] + "买" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+狮子座+买+饮料 例如 在狮子座买饮料 7
	case 21:
		name := "在" + l.constellation[rand.Intn(len(l.constellation))] + "买" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+天斑路+卖+饮料 例如 在天斑路卖饮料 7
	case 22:
		name := "在" + l.road[rand.Intn(len(l.road))] + "卖" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+南美洲+卖+饮料 例如 在南美洲卖饮料 7
	case 23:
		name := "在" + l.continent[rand.Intn(len(l.continent))] + "卖" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+狮子座+卖+饮料 例如 在狮子座卖饮料 7
	case 24:
		name := "在" + l.constellation[rand.Intn(len(l.constellation))] + "卖" + l.drink[rand.Intn(len(l.drink))]
		return name
		//在+天斑路+买+大米 例如 在天斑路买大米 7
	case 25:
		name := "在" + l.road[rand.Intn(len(l.road))] + "买" + l.food[rand.Intn(len(l.food))]
		return name
		//在+南美洲+买+大米 例如 在南美洲买大米 7
	case 26:
		name := "在" + l.continent[rand.Intn(len(l.continent))] + "买" + l.food[rand.Intn(len(l.food))]
		return name
		//在+狮子座+买+大米 例如 在狮子座买大米 7
	case 27:
		name := "在" + l.constellation[rand.Intn(len(l.constellation))] + "买" + l.food[rand.Intn(len(l.food))]
		return name
		//在+天斑路+卖+大米 例如 在天斑路卖大米 7
	case 28:
		name := "在" + l.road[rand.Intn(len(l.road))] + "卖" + l.food[rand.Intn(len(l.food))]
		return name
		//在+南美洲+卖+大米 例如 在南美洲卖大米 7
	case 29:
		name := "在" + l.continent[rand.Intn(len(l.continent))] + "卖" + l.food[rand.Intn(len(l.food))]
		return name
		//在+狮子座+卖+大米 例如 在狮子座卖大米 7
	case 30:
		name := "在" + l.constellation[rand.Intn(len(l.constellation))] + "卖" + l.food[rand.Intn(len(l.food))]
		return name
		//小奶猫（人物1）+爱吃+大米 例如 小奶猫爱吃大米 7
	case 31:
		name := l.people[1][rand.Intn(len(l.people[1]))] + "爱吃" + l.food[rand.Intn(len(l.food))]
		return name
		//小奶猫（人物1）+爱喝+汇源 例如 小奶猫爱喝汇源 7
	case 32:
		name := l.people[1][rand.Intn(len(l.people[1]))] + "爱喝" + l.drink[rand.Intn(len(l.drink))]
		return name
		//爱打球的+詹姆斯（人物1） 例如 爱打球的詹姆斯 7
	case 33:
		name := "爱打球的" + l.people[1][rand.Intn(len(l.people[1]))]
		return name
		//爱打台球的+梅西（人物0） 例如 爱打台球的梅西 7
	case 34:
		name := "爱打台球的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		//爱+梅西（人物0） 例如 爱打台球的梅西 7
	case 35:
		name := "爱打台球的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		//东晋+做法的+小米 例如 东晋做法的小米 7
	case 36:
		name := l.cityState[rand.Intn(len(l.cityState))] + "做法的" + l.food[rand.Intn(len(l.food))]
		return name
		// 梅西（人物1）+喝上了+饮料+ 例如 梅西喝上了饮料 7
	case 37:
		name := l.people[0][rand.Intn(len(l.people[0]))] + "喝上了" + l.drink[rand.Intn(len(l.drink))]
		return name
		// 做什么事情1 + 人物0 例如 吃爆米花的马骥 7
	case 38:
		name := l.actSomething[rand.Intn(len(l.actSomething))] + "的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		// 做什么事情2 + 人物1 例如 上浙大的莫扎特 7
	case 39:
		name := l.actSomethingTwo[rand.Intn(len(l.actSomethingTwo))] + "的" + l.people[1][rand.Intn(len(l.people[1]))]
		return name
		// 做什么事情3 + 人物1 例如 在直播的莫扎特 7
	case 40:
		name := l.actSomethingThree[rand.Intn(len(l.actSomethingThree))] + "的" + l.people[1][rand.Intn(len(l.people[1]))]
		return name
		// 人物0+做什么事情4 例如 马骥救了牧羊犬 7
	case 41:
		name := l.people[0][rand.Intn(len(l.people[0]))] + l.actSomethingFour[rand.Intn(len(l.actSomethingFour))]
		return name
		// 职务+做什么事情4 例如 经理救了牧羊犬 7
	case 42:
		name := l.position[rand.Intn(len(l.position))] + l.actSomethingFour[rand.Intn(len(l.actSomethingFour))]
		return name
		// 做什么事情1+职务 例如 吃爆米花的经理 7
	case 43:
		name := l.actSomething[rand.Intn(len(l.actSomething))] + "的" + l.position[rand.Intn(len(l.position))]
		return name
		// 做什么事情1+的+食物 例如 在吃毛豆的雪糕 7
	case 44:
		name := l.actSomething[rand.Intn(len(l.actSomething))] + "的" + l.food[rand.Intn(len(l.food))]
		return name
	case 45:
		// 例如 莫扎特爱喝果汁 7
		name := l.people[1][rand.Intn(len(l.people[1]))] + "爱喝" + l.drink[rand.Intn(len(l.drink))]
		return name
	case 46:
		// 例如 梅西爱上春熙路 7
		name := l.people[0][rand.Intn(len(l.people[0]))] + "爱上" + l.road[rand.Intn(len(l.road))]
		return name
	case 47:
		// 例如 莫扎特爱上东晋 7
		name := l.people[1][rand.Intn(len(l.people[1]))] + "爱上" + l.cityState[rand.Intn(len(l.cityState))]
		return name
	case 48:
		// 例如 梅西爱上北美洲 7
		name := l.people[0][rand.Intn(len(l.people[0]))] + "爱上" + l.continent[rand.Intn(len(l.continent))]
		return name
	default:
		// 形容词+人物 例如：帅气的戴维斯 5-6
		rand.Seed(l.seed + 1)
		lens := rand.Intn(2)
		name := l.adjective[rand.Intn(len(l.adjective))] + l.people[lens][rand.Intn(len(l.people[lens]))]
		return name
	}
	return ""
}
func (l *nickname) LongNickname() string {
	selected := rand.Intn(12)
	switch selected {
	// 路、街、巷、桥、坊+形容词+人物 例如 铜锣湾帅气的梅西 8
	case 1:
		name := l.road[rand.Intn(len(l.road))] + l.adjective[rand.Intn(len(l.adjective))] + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		// 路、街、巷、桥、坊+形容词+食物 例如 铜锣湾帅气的栗子 8
	case 2:
		name := l.road[rand.Intn(len(l.road))] + l.adjective[rand.Intn(len(l.adjective))] + l.food[rand.Intn(len(l.food))]
		return name
		// 路、街、巷、桥、坊+形容词+职务 例如 铜锣湾帅气的经理 8
	case 3:
		name := l.road[rand.Intn(len(l.road))] + l.adjective[rand.Intn(len(l.adjective))] + l.position[rand.Intn(len(l.position))]
		return name
		// 洲+形容词+人物 例如 大洋洲帅气的梅西 8
	case 4:
		name := l.continent[rand.Intn(len(l.continent))] + l.adjective[rand.Intn(len(l.adjective))] + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		// 洲+形容词+食物 例如 大洋洲帅气的栗子 8
	case 5:
		name := l.continent[rand.Intn(len(l.continent))] + l.adjective[rand.Intn(len(l.adjective))] + l.food[rand.Intn(len(l.food))]
		return name
		// 洲+形容词+职务 例如 大洋洲帅气的经理 8
	case 6:
		name := l.continent[rand.Intn(len(l.continent))] + l.adjective[rand.Intn(len(l.adjective))] + l.position[rand.Intn(len(l.position))]
		return name
		// 城市、国家 +星座+人物 例如 东城双子座的梅西 8
	case 7:
		name := l.cityState[rand.Intn(len(l.cityState))] + l.constellation[rand.Intn(len(l.constellation))] + "的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		// 城市、国家+星座+食物 例如 东城双子座的土豆 8
	case 8:
		name := l.cityState[rand.Intn(len(l.cityState))] + l.constellation[rand.Intn(len(l.constellation))] + "的" + l.food[rand.Intn(len(l.food))]
		return name
	// 做什么事情1+的+人物1 例如 吃爆米花的莫扎特 8
	case 9:
		name := l.actSomething[rand.Intn(len(l.actSomething))] + "的" + l.people[1][rand.Intn(len(l.people[1]))]
		return name
		// 人物1+做什么事情4 例如 莫扎特救了牧羊犬8
	case 10:
		name := l.people[1][rand.Intn(len(l.people[1]))] + l.actSomethingFour[rand.Intn(len(l.actSomethingFour))]
		return name
		// 人物0+做什么事情4 例如 梅西在直播喝饮料8
	case 11:
		name := l.people[0][rand.Intn(len(l.people[0]))] + "在直播喝" + l.drink[rand.Intn(len(l.drink))]
		return name
	// 人物0+做什么事情4 例如 梅西在直播卖大米8
	case 12:
		name := l.people[0][rand.Intn(len(l.people[0]))] + "在直播卖" + l.food[rand.Intn(len(l.food))]
		return name
	default:
		name := l.cityState[rand.Intn(len(l.cityState))] + l.constellation[rand.Intn(len(l.constellation))] + "的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
	}
	return ""
}
func (l *nickname) ShortNickname() string {
	selected := rand.Intn(26)
	switch selected {
	// 做什么事情3 + 人物1 例如 在直播的梅西 6
	case 0:
		name := l.actSomethingThree[rand.Intn(len(l.actSomethingThree))] + "的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
	// 做什么事情2 + 人物1 例如 上浙大的梅西 6
	case 1:
		name := l.actSomethingTwo[rand.Intn(len(l.actSomethingTwo))] + "的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
	// 做什么事情3+的+食物 例如 在直播的雪糕 6
	case 2:
		name := l.actSomethingThree[rand.Intn(len(l.actSomethingThree))] + "的" + l.food[rand.Intn(len(l.food))]
		return name
	// 做什么事情2+的+食物 例如 上浙大的雪糕 6
	case 3:
		name := l.actSomethingTwo[rand.Intn(len(l.actSomethingTwo))] + "的" + l.food[rand.Intn(len(l.food))]
		return name
		// 形容词+人物1 例如 帅气的莫扎特 6
	case 4:
		name := l.adjective[rand.Intn(len(l.adjective))] + l.people[1][rand.Intn(len(l.people[1]))]
		return name
		// 星座+人物0 例如 天蝎座的梅西 6
	case 5:
		name := l.constellation[rand.Intn(len(l.constellation))] + "的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		// 洲际+人物0 例如 大洋洲的梅西 6
	case 6:
		name := l.continent[rand.Intn(len(l.continent))] + "的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
	// 路、街道+人物0 例如 天斑路的梅西 6
	case 7:
		name := l.road[rand.Intn(len(l.road))] + "的" + l.people[0][rand.Intn(len(l.people[0]))]
		return name
		// 星座+职务 例如 天蝎座的经理 6
	case 8:
		name := l.constellation[rand.Intn(len(l.constellation))] + "的" + l.position[rand.Intn(len(l.position))]
		return name
		// 洲际+职务 例如 大洋洲的经理 6
	case 9:
		name := l.continent[rand.Intn(len(l.continent))] + "的" + l.position[rand.Intn(len(l.position))]
		return name
	// 路、街道+职务 例如 天斑路的经理 6
	case 10:
		name := l.road[rand.Intn(len(l.road))] + "的" + l.position[rand.Intn(len(l.position))]
		return name
		// 去+国、城+喝+饮料 例如 去东晋喝汇源 6
	case 11:
		name := "去" + l.cityState[rand.Intn(len(l.cityState))] + "喝" + l.drink[rand.Intn(len(l.drink))]
		return name
		// 去+国、城市+吃+食物 例如 去东晋吃大米 6
	case 12:
		name := "去" + l.cityState[rand.Intn(len(l.cityState))] + "喝" + l.food[rand.Intn(len(l.food))]
		return name
		// 去+国、城+卖+饮料 例如 去东晋卖汇源 6
	case 13:
		name := "去" + l.cityState[rand.Intn(len(l.cityState))] + "卖" + l.drink[rand.Intn(len(l.drink))]
		return name
		// 去+国、城市+卖+食物 例如 去东晋卖大米 6
	case 14:
		name := "去" + l.cityState[rand.Intn(len(l.cityState))] + "卖" + l.food[rand.Intn(len(l.food))]
		return name
		// 州+喝+汇源 例如 北美洲喝汇源 6
	case 15:
		name := l.continent[rand.Intn(len(l.continent))] + "喝" + l.drink[rand.Intn(len(l.drink))]
		return name
		// 州+卖+汇源 例如 北美洲卖大米 6
	case 16:
		name := l.continent[rand.Intn(len(l.continent))] + "卖" + l.food[rand.Intn(len(l.food))]
		return name
	// 路、街道+喝+汇源 例如 天星路喝汇源 6
	case 17:
		name := l.road[rand.Intn(len(l.road))] + "喝" + l.drink[rand.Intn(len(l.drink))]
		return name
		// 路、街道+卖+大米 例如 天星路卖大米 6
	case 18:
		name := l.road[rand.Intn(len(l.road))] + "卖" + l.food[rand.Intn(len(l.food))]
		return name
	case 19:
		// 例如 织女爱喝果汁 6
		name := l.people[0][rand.Intn(len(l.people[0]))] + "爱喝" + l.drink[rand.Intn(len(l.drink))]
		return name
	case 20:
		// 例如 织女是个律师 6
		name := l.people[0][rand.Intn(len(l.people[0]))] + "是个" + l.position[rand.Intn(len(l.position))]
		return name
	case 21:
		// 例如 织女爱吃小米 6
		name := l.people[0][rand.Intn(len(l.people[0]))] + "爱吃" + l.food[rand.Intn(len(l.food))]
		return name
	case 22:
		// 例如 织女爱上希腊 6
		name := l.people[0][rand.Intn(len(l.people[0]))] + "爱上" + l.cityState[rand.Intn(len(l.cityState))]
		return name
	case 23:
		// 例如 经理爱上希腊 6
		name := l.position[rand.Intn(len(l.position))] + "爱上" + l.cityState[rand.Intn(len(l.cityState))]
		return name
	case 24:
		// 例如 经理爱喝果汁 6
		name := l.position[rand.Intn(len(l.position))] + "爱喝" + l.drink[rand.Intn(len(l.drink))]
		return name
	case 25:
		// 例如 经理爱吃大米 6
		name := l.position[rand.Intn(len(l.position))] + "爱吃" + l.food[rand.Intn(len(l.food))]
		return name
	default:
		// 形容词+人物 例如：帅气的戴维斯 5-6
		rand.Seed(l.seed + 1)
		lens := rand.Intn(2)
		name := l.adjective[rand.Intn(len(l.adjective))] + l.people[lens][rand.Intn(len(l.people[lens]))]
		return name
	}
	return ""
}

func BatchShortGenerate(num int) []string {
	if num <= 0 {
		num = 4
	}
	nickname := newNickname()
	nickname.seed = time.Now().UnixNano() + 1
	names := make([]string, num)
	for i := 0; i < num; i++ {
		nickname.seed += 2000
		names[i] = nickname.ShortNickname()
	}
	return names
}
func BatchLongGenerate(num int) []string {
	if num <= 0 {
		num = 4
	}
	nickname := newNickname()
	nickname.seed = time.Now().UnixNano() + 1
	names := make([]string, num)
	for i := 0; i < num; i++ {
		nickname.seed += 2000
		names[i] = nickname.LongNickname()
	}
	return names
}
func BatchGenerate(num int) []string {
	if num <= 0 {
		num = 4
	}
	nickname := newNickname()
	nickname.seed = time.Now().UnixNano() + 1
	names := make([]string, num)
	for i := 0; i < num; i++ {
		nickname.seed += 1000
		names[i] = nickname.Generate()
	}
	return names
}

func Generate() string {
	nickname := newNickname()
	nickname.seed = time.Now().UnixNano() + 1
	return nickname.Generate()
}

func GenerateShort() string {
	nickname := newNickname()
	nickname.seed = time.Now().UnixNano() + 2
	return nickname.ShortNickname()
}
