package random

import (
	"math/rand"
	"time"
)

// 男人物
var manPerson = []string{
	"梅西", "罗纳尔多", "内马尔", "詹姆斯", "姆巴佩", "苏牙", "小罗", "大罗", "鲁尼", "本泽马", "贝利", "约翰", "柯南", "米老鼠", "罗斯福",
	"弗朗茨", "马斯克", "巴特尔", "特朗普", "贝斯特", "范巴斯滕", "尤西比奥", "萧言", "博比", "白川", "库里", "加特林", "厄齐尔", "邓肯",
	"巴乔", "斯坦利", "济科", "弗兰科", "加林查", "保罗", "肯尼", "巴蒂斯图塔", "坎通纳", "哈吉", "罗马里奥", "哈登", "保罗", "杜兰特",
	"齐达內", "古利特", "查尔斯", "卡卡", "哈维", "伊布", "莫德里奇", "欧文", "巴乔", "萧炎", "鸣人", "佐助", "盖茨比", "乔布斯", "索尔",
	"宙斯", "星矢", "托尼", "科比", "乔丹", "西瓜太郎", "杨过", "永恩", "爱因斯坦", "肖申克", "摩尔", "西瓜次郎", "宋江", "吴用", "林冲",
	"花荣", "柴进", "鲁智深", "武松", "戴宗", "阮小七", "孔亮", "周通", "莫德里奇", "阿森纳", "巴敏", "巴赫", "巴扎黑",
}

// 女人物
var womanPerson = []string{
	"王昭君", "杨玉环", "雅典娜", "貂蝉", "美女", "雪曼", "少女", "女王", "娜可露露", "孙尚香", "皇后", "白曼", "诗筠", "王后", "姑娘", "小奶猫", "扈三娘",
	"小公举", "小可爱", "奥利奥", "老板娘", "刘小妹", "莫小宣", "子衿", "雪晴", "偌伊怡", "白雪", "太平公主", "婉儿", "赵飞燕", "甄姬", "伽罗", "虞姬",
	"戚夫人", "西西", "白鹿", "苏妲己", "大乔", "越贵妃", "蝴蝶", "冰心", "慈禧", "女娲", "织女", "姜嫄", "西施", "孟母", "吕后", "安琪拉", "艾琳", "小懒猫",
	"蔡文姬", "二乔", "花木兰", "韦后", "芈月", "顾大嫂", "孙二娘", "曼青", "含桃", "娇娥", "丽娜", "美娜", "美妮", "靖瑶", "上官婉儿", "米莱狄", "莫甘娜",
	"夏洛特", "钟无艳", "小霞", "沙奈朵", "布丽吉塔", "琪塔娜", "贝姐", "艾达王", "伊丽莎白", "爱丽丝", "卡珊德拉", "玛西亚", "女皇", "小仙女", "方沐霖",
	"林宛白", "叶清逸", "慕无霜", "白慕雅", "兰婧雪", "柳如烟", "萧冷玉", "萧芷玉",
}

// manAdjective 男性形容词
var manAdjective = []string{
	"帅气的", "迷人的", "蓬勃的", "隐身的", "快乐的", "冷静的", "醉熏的", "糊涂的", "积极的", "梦幻的", "放肆的", "不变的", "沉静的",
	"冷酷的", "深情的", "粗暴的", "温柔的", "可爱的", "愉快的", "义气的", "认真的", "威武的", "传统的", "潇洒的", "自然的", "青春的", "炫耀的",
	"专一的", "听话的", "昏睡的", "狂野的", "等待的", "搞怪的", "幽默的", "魁梧的", "活泼的", "开心的", "高兴的", "超帅的", "留胡子的", "失眠的",
	"坦率的", "直率的", "轻松的", "痴情的", "完美的", "精明的", "无聊的", "有魅力的", "丰富的", "傻傻的", "爱听歌的", "温顺的", "矮小的", "安静的",
	"繁荣的", "炙热的", "暴躁的", "碧蓝的", "俊逸的", "英勇的", "健忘的", "故意的", "无心的", "土豪的", "朴实的", "兴奋的", "铁打的", "纯情的",
	"幸福的", "淡定的", "不安的", "阔达的", "孤独的", "独特的", "疯狂的", "时尚的", "落后的", "风趣的", "忧伤的", "大胆的", "爱笑的", "胖胖的",
	"健康的", "合适的", "玩命的", "沉默的", "斯文的", "香蕉的", "苹果的", "鲤鱼的", "鳗鱼的", "任性的", "细心的", "粗心的", "大意的", "迷路的",
	"酷酷的", "健壮的", "英俊的", "霸气的", "阳光的", "默默的", "大力的", "孝顺的", "忧虑的", "着急的", "紧张的", "善良的", "凶狠的", "烂漫的",
	"重要的", "危机的", "欢喜的", "欣慰的", "满意的", "跳跃的", "诚心的", "称心的", "如意的", "怡然的", "娇气的", "无奈的", "无语的", "激动的",
	"愤怒的", "美好的", "感动的", "激情的", "激昂的", "震动的", "虚拟的", "超级的", "寒冷的", "精明的", "明理的", "犹豫的", "忧郁的", "寂寞的",
	"奋斗的", "勤奋的", "现代的", "过时的", "稳重的", "热情的", "含蓄的", "开放的", "无辜的", "多情的", "纯真的", "拉长的", "热心的", "从容的",
	"体贴的", "风中的", "曾经的", "追寻的", "儒雅的", "优雅的", "开朗的", "外向的", "内向的", "清爽的", "文艺的", "长情的", "平常的", "单身的",
	"伶俐的", "高大的", "懦弱的", "爱笑的", "乐观的", "耍酷的", "酷炫的", "神勇的", "年轻的", "唠叨的", "瘦瘦的", "无情的", "包容的", "害怕的",
	"顺心的", "畅快的", "舒适的", "靓丽的", "负责的", "背后的", "简单的", "谦让的", "彩色的", "缥缈的", "欢呼的", "生动的", "复杂的", "慈祥的",
	"仁爱的", "魔幻的", "虚幻的", "淡然的", "受伤的", "雪白的", "高高的", "糟糕的", "顺利的", "闪闪的", "羞涩的", "缓慢的", "迅速的", "优秀的",
	"聪明的", "含糊的", "俏皮的", "淡淡的", "坚强的", "平淡的", "欣喜的", "能干的", "灵巧的", "友好的", "机智的", "机灵的", "正直的", "谨慎的",
	"俭朴的", "殷勤的", "虚心的", "辛勤的", "自觉的", "无私的", "无限的", "踏实的", "老实的", "现实的", "可靠的", "务实的", "拼搏的", "个性的",
	"粗犷的", "活力的", "成就的", "勤劳的", "单纯的", "落寞的", "朴素的", "悲凉的", "忧心的", "洁净的", "清秀的", "自由的", "小巧的", "单薄的",
	"贪玩的", "刻苦的", "干净的", "壮观的", "和谐的", "文静的", "调皮的", "害羞的", "安详的", "自信的", "端庄的", "坚定的", "美满的", "舒心的",
	"温暖的", "专注的", "勤恳的", "美丽的", "腼腆的", "优美的", "甜蜜的", "整齐的", "动人的", "典雅的", "尊敬的", "舒服的", "妩媚的", "发嗲的",
	"喜悦的", "甜美的", "彪壮的", "强健的", "大方的", "俊秀的", "聪慧的", "陶醉的", "悦耳的", "动听的", "明亮的", "结实的", "魁梧的", "哭泣的",
	"标致的", "清脆的", "敏感的", "光亮的", "大气的", "老迟到的", "知性的", "冷傲的", "呆萌的", "野性的", "隐形的", "微胖的", "微笑的", "笨笨的",
	"撒娇的", "贪玩的", "执着的", "迷离的", "花痴的", "想人陪的", "眼睛大的", "高贵的", "傲娇的", "心灵美的", "高雅的", "细腻的", "天真的",
	"怕黑的", "感性的", "飘逸的", "孤独的", "忐忑的", "单身的", "孤单的", "懵懂的", "嘴碎的", "吐槽的", "敬业的", "刚毅的", "火爆的", "珍贵的",
	"幸运的", "喧闹的", "牵强的", "欢乐的", "真实的", "无敌的", "天生的", "慕名的", "奇葩的", "难过的",
}

// 女性形容词
var womanAdjective = []string{
	"迷人的", "隐身的", "快乐的", "冷静的", "醉熏的", "糊涂的", "积极的", "梦幻的", "爱美的", "放肆的", "不变的", "火爆的", "欢乐的",
	"深情的", "温柔的", "可爱的", "愉快的", "认真的", "传统的", "漂亮的", "丰满的", "碎花裙的", "青春的", "嘴碎的", "珍贵的", "喧闹的", "怕黑的",
	"专一的", "听话的", "昏睡的", "等待的", "搞怪的", "幽默的", "活泼的", "开心的", "高兴的", "铁打的", "吐槽的", "敬业的", "懵懂的", "感性的",
	"坦率的", "直率的", "轻松的", "痴情的", "完美的", "精明的", "无聊的", "有魅力的", "丰富的", "高挑的", "傻傻的", "冷艳的", "爱听歌的", "飘逸的",
	"繁荣的", "饱满的", "炙热的", "暴躁的", "碧蓝的", "健忘的", "故意的", "无心的", "土豪的", "朴实的", "兴奋的", "奇葩的", "孤单的", "牵强的",
	"幸福的", "淡定的", "不安的", "阔达的", "孤独的", "独特的", "疯狂的", "时尚的", "落后的", "风趣的", "忧伤的", "大胆的", "爱笑的", "矮小的",
	"健康的", "合适的", "玩命的", "沉默的", "斯文的", "香蕉的", "苹果的", "鲤鱼的", "鳗鱼的", "任性的", "细心的", "粗心的", "大意的", "甜甜的",
	"默默的", "大力的", "孝顺的", "忧虑的", "着急的", "紧张的", "善良的", "凶狠的", "害怕的", "温顺的", "幸运的", "慕名的", "真实的", "刚毅的",
	"重要的", "危机的", "欢喜的", "欣慰的", "满意的", "跳跃的", "诚心的", "称心的", "如意的", "怡然的", "娇气的", "无奈的", "无语的", "激动的",
	"愤怒的", "美好的", "感动的", "激情的", "激昂的", "虚拟的", "超级的", "寒冷的", "精明的", "明理的", "犹豫的", "忧郁的", "寂寞的", "单身的",
	"奋斗的", "勤奋的", "现代的", "过时的", "稳重的", "热情的", "含蓄的", "开放的", "无辜的", "多情的", "纯真的", "拉长的", "热心的", "从容的",
	"体贴的", "风中的", "曾经的", "追寻的", "儒雅的", "优雅的", "开朗的", "外向的", "内向的", "清爽的", "文艺的", "长情的", "平常的", "单身的",
	"伶俐的", "高大的", "懦弱的", "柔弱的", "爱笑的", "乐观的", "耍酷的", "酷炫的", "神勇的", "年轻的", "唠叨的", "瘦瘦的", "无情的", "包容的",
	"顺心的", "畅快的", "舒适的", "靓丽的", "负责的", "背后的", "简单的", "谦让的", "彩色的", "缥缈的", "欢呼的", "生动的", "复杂的", "慈祥的",
	"仁爱的", "魔幻的", "虚幻的", "淡然的", "受伤的", "雪白的", "高高的", "糟糕的", "顺利的", "闪闪的", "羞涩的", "缓慢的", "迅速的", "优秀的",
	"聪明的", "含糊的", "俏皮的", "淡淡的", "坚强的", "平淡的", "欣喜的", "能干的", "灵巧的", "友好的", "机智的", "机灵的", "正直的", "谨慎的",
	"俭朴的", "殷勤的", "虚心的", "辛勤的", "自觉的", "无私的", "无限的", "踏实的", "老实的", "现实的", "可靠的", "务实的", "拼搏的", "个性的",
	"活力的", "成就的", "勤劳的", "单纯的", "落寞的", "朴素的", "悲凉的", "忧心的", "洁净的", "清秀的", "自由的", "小巧的", "单薄的", "忐忑的",
	"贪玩的", "刻苦的", "干净的", "壮观的", "和谐的", "文静的", "调皮的", "害羞的", "安详的", "自信的", "端庄的", "坚定的", "美满的", "舒心的",
	"温暖的", "专注的", "勤恳的", "美丽的", "腼腆的", "优美的", "甜美的", "甜蜜的", "整齐的", "动人的", "典雅的", "尊敬的", "舒服的", "妩媚的",
	"秀丽的", "喜悦的", "甜美的", "大方的", "俊秀的", "聪慧的", "陶醉的", "悦耳的", "动听的", "明亮的", "结实的", "无敌的", "天生的", "孤独的",
	"标致的", "清脆的", "敏感的", "光亮的", "大气的", "老迟到的", "知性的", "冷傲的", "呆萌的", "野性的", "隐形的", "微胖的", "微笑的", "笨笨的",
	"难过的", "沉静的", "炫耀的", "失眠的", "安静的", "纯情的", "胖胖的", "迷路的", "烂漫的", "哭泣的", "贤惠的", "苗条的", "温婉的", "发嗲的",
	"撒娇的", "贪玩的", "执着的", "迷离的", "花痴的", "想人陪的", "眼睛大的", "高贵的", "傲娇的", "心灵美的", "高雅的", "细腻的", "天真的",
}

// actSomething 做什么事情
var actSomething = []string{
	"打豆豆", "吃爆米花", "走向人生巅峰", "大力出奇迹", "得到了金奖", "踢爆世界杯", "有亿点点忧伤", "完成了滑雪", "完成了跳伞", "完成了大四喜", "完成了潜水",
	"望穿秋水", "掐指一算", "横扫千军", "一眼定情", "会发财", "求而不得", "舞力四射", "横扫六合", "救了一只猫", "在巴黎徒步", "心花怒放", "在看电影", "踢足球",
	"完成了训练", "穿马甲", "的小耳朵", "幼稚鬼", "打老虎机", "淘气鬼", "小淘气", "在唱歌", "打游戏", "发大财", "财运旺", "在东京赏樱花", "在武汉赏樱花", "上浙大",
	"学英语", "在冲浪", "游西湖", "逛铁塔", "在吹牛", "在跳绳", "在打球", "吃西瓜", "剥橘子", "剥柚子", "在画画", "在跑步", "手工艺术", "去海边看日落", "在放牛",
	"逛超市", "画曼陀罗", "练习毛笔字", "正在写心经", "在骑车", "喝奶茶", "手磨咖啡", "看话剧", "办画展", "摆烂", "摆地摊", "在蹦极", "在蹦迪", "养了一只猫",
	"养了一只狗", "骑上小摩托", "骑上骏马", "看音乐会", "种了一棵树", "救了一条狗", "救了牧羊犬", "在K歌", "逛动物园", "一起玩大富翁", "一起喝醉", "在放羊",
	"在漂流", "玩桌球", "穿上金靴", "穿上了盛装", "一起打雪仗", "一起堆雪人", "说瓜不甜", "说骑大明湖", "去西湖谈恋爱", "上北大", "上清华", "上哈佛", "上耶鲁",
	"参加马拉松", "打乒乓球", "品北巷栀酒", "品茉莉花茶", "逛中央公园", "在数羊", "看流星", "看星星", "看日落", "看夕阳", "逛巴黎", "研究木乃伊", "在罗马斗牛",
	"登上哈利法塔", "逛金字塔", "看非洲雄狮", "跳皮筋", "在回忆童年", "看西游记", "看三国", "看牡丹亭", "看岳飞传", "戴手表", "吃米其林", "吃冰淇淋", "削苹果",
	"跪榴莲", "玩消消乐", "喝豆浆", "吃油条", "黑着脸", "打老虎", "打蜗牛", "骑蜗牛", "在斗牛", "的金手套", "戴帽子", "在划水", "打麻将", "打麻糍", "卖西瓜",
	"买苹果", "买香蕉", "在卖鞋", "卖早餐", "在喝早茶", "在搭车", "喝啤酒", "讲笑话", "爬珠峰", "爬天梯", "骑骆驼", "在洗衣服", "喝咖啡", "喝拿铁", "在遛弯",
	"在打针", "牵绵羊", "放烟花", "放烟火", "放鞭炮", "放风筝", "扑蝴蝶", "捉迷藏", "在捉蜻蜓", "在掏鸟窝", "摘栗子", "在采山药", "摘山渣", "吹竹笛", "抓石头",
	"玩跳棋", "丢沙包", "踢毽子", "打弹弓", "打盒子", "玩拨浪鼓", "牵着狗", "牵蜗牛", "在撕名牌", "在奔跑", "弹钢琴", "在摔泥碗", "在跳房子", "捏泥人", "吃月饼",
	"在包粽子", "煮饺子", "煎饺子", "吃冰糕", "吃糖葫芦", "吃饺子", "爬庐山", "登上黄山", "挂冰灯", "挂灯笼", "挂彩灯", "贴对联", "贴福字",
}

// GenerateNickname 生成随机昵称
func GenerateNickname(gender int) string {
	var name string
	rand.Seed(time.Now().UnixNano())
	selectedType := rand.Intn(2)
	switch selectedType {
	// 形容词+人物 例如：帅气的罗纳尔多
	case 0:
		// 随机性别
		if gender < 1 || gender > 2 {
			rand.Seed(time.Now().UnixNano() + 1)
			gender = rand.Intn(2) + 1 + gender
		}
		// 性别 1男 2女
		if gender == 1 {
			name = manAdjective[rand.Intn(len(manAdjective))] + manPerson[rand.Intn(len(manPerson))]
		}
		// 性别 1男 2女
		if gender == 2 {
			name = womanAdjective[rand.Intn(len(womanAdjective))] + womanPerson[rand.Intn(len(womanPerson))]
		}
	// 人物+做事情 例如：梅西吃爆米花
	case 1:
		// 随机性别
		if gender < 1 || gender > 2 {
			rand.Seed(time.Now().UnixNano() + 1)
			gender = rand.Intn(2) + 1 + gender
		}
		// 性别 1男 2女
		if gender == 1 {
			name = manPerson[rand.Intn(len(manPerson))] + actSomething[rand.Intn(len(actSomething))]
		}
		// 性别 1男 2女
		if gender == 2 {
			name = womanPerson[rand.Intn(len(womanPerson))] + actSomething[rand.Intn(len(actSomething))]
		}
	}
	return name
}
